<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"s3","label":"dev","backend":"28a6dc627026b30bc9907ed1f7cc3d29a79e18e69eae0b820c5b9609e5d966e0","plan_job_ref":"Job CICD for Splitrr Infra #59 at https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10677956742","plan_out_hash":"b8aff89d7bf598652f64a359634f8fafb48c4be967f216b64edddf4f641880cc","plan_hash":"7493e61ab7ea67e650edba4edb761fb436327e4b3b63fad69528b1fb268e8088","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 2 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app_route53_record.aws_route53_record.site_domain will be created
+   resource "aws_route53_record" "site_domain" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "app"
+       type            = "A"
+       zone_id         = "*********************"

+       alias {
+           evaluate_target_health = true
+           name                   = "d2kv2y9eh8mtkp.cloudfront.net"
+           zone_id                = "**************"
        }
    }

  # module.ecs-ec2.aws_ecs_service.app will be updated in-place
!~  resource "aws_ecs_service" "app" {
        id                                 = "arn:aws:ecs:us-east-1:949263681218:service/EC2-ECS-CLUSTER/splitrr-dev-backend-ecs-ec2-service"
        name                               = "splitrr-dev-backend-ecs-ec2-service"
        tags                               = {
            "Name" = "splitrr-dev-backend-ecs-ec2-service"
        }
!~      task_definition                    = "arn:aws:ecs:us-east-1:949263681218:task-definition/splitrr-dev-backend-ecs-ec2-task-def:6" -> (known after apply)
#        (16 unchanged attributes hidden)

#        (6 unchanged blocks hidden)
    }

  # module.ecs-ec2.aws_ecs_task_definition.app must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
!~      arn                      = "arn:aws:ecs:us-east-1:949263681218:task-definition/splitrr-dev-backend-ecs-ec2-task-def:6" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:us-east-1:949263681218:task-definition/splitrr-dev-backend-ecs-ec2-task-def" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   mountPoints      = []
                    name             = "splitrr-dev-backend-ecs-ec2-container"
!~                  portMappings     = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   systemControls   = []
-                   volumesFrom      = []
#                    (5 unchanged attributes hidden)
                },
            ]
        )
!~      id                       = "************************************" -> (known after apply)
!~      memory                   = "700" -> "701" # forces replacement
!~      revision                 = 6 -> (known after apply)
        tags                     = {
            "Name" = "splitrr-dev-backend-ecs-ec2-task-def"
        }
#        (11 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [CICD for Splitrr Infra #59](https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10677956742)